Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РешенияКлиентовПоЗначениямЭСП</xr:Item>
				<xr:Item>InformationRegister.АналогиЦенныхБумаг</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭСП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦелиИспользованияАналогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройки</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияНастроекУчетаЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНастроекУчетаЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах/Ext/ObjectModule.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтотОбъект.ПометкаУдаления Тогда	
	
		// Дата начала действия не должна быть раньше даты документа
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Дата)
			И ЗначениеЗаполнено(ЭтотОбъект.ДатаНачалаДействия)
			И НачалоДня(ЭтотОбъект.ДатаНачалаДействия) < НачалоДня(ЭтотОбъект.Дата) 
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала действия сведений не должна быть раньше даты документа", ЭтотОбъект, "ДатаНачалаДействия", , Отказ);
		КонецЕсли;
		
		// Дата окончания действия аналога не должна быть раньше даты начала действия
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ДатаНачалаДействия) Тогда
			Для Каждого СтрокаАналога Из ЭтотОбъект.Аналоги Цикл
				Если ЗначениеЗаполнено(СтрокаАналога.ДатаОкончанияДействия)
					И СтрокаАналога.ДатаОкончанияДействия < ЭтотОбъект.ДатаНачалаДействия
				Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтрШаблон("Строка %1: дата окончания действия аналога не должна быть раньше даты начала действия", СтрокаАналога.НомерСтроки), ЭтотОбъект, "Аналоги[" + Формат(СтрокаАналога.НомерСтроки - 1, "ЧГ=0") + "].ДатаОкончанияДействия", , Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Ценная бумага нужна для сведений об ЭСП, настройках и аналогах
		
		Если ЭтотОбъект.ЭСП.Количество() > 0
			ИЛИ ЭтотОбъект.НастройкиУчета.Количество() > 0
			ИЛИ ЭтотОбъект.Аналоги.Количество() > 0
		Тогда
			ПроверяемыеРеквизиты.Добавить("ЦеннаяБумага");	
		КонецЕсли;
		
		// Проверка соответствия клиента и организации данным партий
		Для каждого СтрокаЭСП Из ЭтотОбъект.ЭСП Цикл
		
			РеквизитыПартии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаЭСП.Партия, "СчетДоверительногоУправления, Организация");
			
			Если ТипЗнч(ЭтотОбъект.Клиент) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
				
				КлиентДляПроверки = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(РеквизитыПартии.СчетДоверительногоУправления, ЭтотОбъект.Дата);
				
				Если ЭтотОбъект.Клиент <> КлиентДляПроверки Тогда
					ТекстОшибки = СтрШаблон("В строке %1 выбрана партия другого клиента д/у", СтрокаЭСП.НомерСтроки);
					ПолеОшибки	= "ЭСП[" + Формат(СтрокаЭСП.НомерСтроки - 1, "ЧГ=") + "].Партия";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПолеОшибки, , Отказ);
				КонецЕсли;
				
			ИначеЕсли ЭтотОбъект.Клиент <> РеквизитыПартии.СчетДоверительногоУправления Тогда

				ТекстОшибки = СтрШаблон("В строке %1 выбрана партия другого счета д/у", СтрокаЭСП.НомерСтроки);
				ПолеОшибки	= "ЭСП[" + Формат(СтрокаЭСП.НомерСтроки - 1, "ЧГ=") + "].Партия";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПолеОшибки, , Отказ);
				
			КонецЕсли;
			
			Если ЭтотОбъект.Организация <> РеквизитыПартии.Организация Тогда
			
				ТекстОшибки = СтрШаблон("В строке %1 выбрана партия другой организации", СтрокаЭСП.НомерСтроки);
				ПолеОшибки	= "ЭСП[" + Формат(СтрокаЭСП.НомерСтроки - 1, "ЧГ=") + "].Партия";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПолеОшибки, , Отказ);
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ЭСП 
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабличнаяЧастьЭСП.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ТабличнаяЧастьЭСП.Партия КАК Партия,
		|	ТабличнаяЧастьЭСП.СтрокаПартии КАК СтрокаПартии,
		|	ТабличнаяЧастьЭСП.ЭСП КАК ЭСП,
		|	ТабличнаяЧастьЭСП.Используется КАК Используется
		|ПОМЕСТИТЬ _ТабличнаяЧастьЭСП
		|ИЗ
		|	&ТабличнаяЧастьЭСП КАК ТабличнаяЧастьЭСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТабличнаяЧастьЭСП.Партия.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ТабличнаяЧастьЭСП.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ТабличнаяЧастьЭСП.Партия КАК Партия,
		|	_ТабличнаяЧастьЭСП.СтрокаПартии КАК СтрокаПартии,
		|	_ТабличнаяЧастьЭСП.ЭСП КАК ЭСП,
		|	_ТабличнаяЧастьЭСП.Используется КАК Используется
		|ИЗ
		|	_ТабличнаяЧастьЭСП КАК _ТабличнаяЧастьЭСП");
	
	Запрос.УстановитьПараметр("ТабличнаяЧастьЭСП", ЭтотОбъект.ЭСП.Выгрузить());
	
	ВыборкаЭСП = Запрос.Выполнить().Выбрать();
	
	Движения.РешенияКлиентовПоЗначениямЭСП.Очистить();
	Движения.РешенияКлиентовПоЗначениямЭСП.Записывать = Истина;
	
	Пока ВыборкаЭСП.Следующий() Цикл
		
		Движение = Движения.РешенияКлиентовПоЗначениямЭСП.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаЭСП);
		
		Движение.Период				= ЭтотОбъект.Дата;
		Движение.Организация		= ЭтотОбъект.Организация;
		Движение.Рынок				= Перечисления.РынкиЦенныхБумаг.Облигации;
		Движение.ЦеннаяБумага		= ЭтотОбъект.ЦеннаяБумага;
		Движение.ДатаНачалаДействия	= ЭтотОбъект.ДатаНачалаДействия;
		
	КонецЦикла;

	Если ТипЗнч(ЭтотОбъект.Клиент) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		КлиентДляДвижений = ЭтотОбъект.Клиент;
	Иначе
		КлиентДляДвижений = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.Клиент, ЭтотОбъект.Дата);
	КонецЕсли;
	
	// Аналоги ценой бумаги
	
	Движения.АналогиЦенныхБумаг.Очистить();
	Движения.АналогиЦенныхБумаг.Записывать = Истина;
	
	Для Каждого СтрокаАналоги Из ЭтотОбъект.Аналоги Цикл
		
		Движение = Движения.АналогиЦенныхБумаг.Добавить();
		
		Движение.Период					= ЭтотОбъект.ДатаНачалаДействия;
		Движение.Организация			= ЭтотОбъект.Организация;
		Движение.Клиент					= КлиентДляДвижений;
		Движение.ЦеннаяБумага			= ЭтотОбъект.ЦеннаяБумага;
		Движение.Аналог					= СтрокаАналоги.ЦеннаяБумага;
		Движение.Назначение				= СтрокаАналоги.Назначение;
		Движение.ДатаОкончанияДействия	= СтрокаАналоги.ДатаОкончанияДействия;
		
	КонецЦикла;

	// Настройки
	
	Движения.ЗначенияНастроекУчетаЦенныхБумаг.Очистить();
	Движения.ЗначенияНастроекУчетаЦенныхБумаг.Записывать = Истина;
	
	Для каждого СтрокаНастройки Из ЭтотОбъект.НастройкиУчета Цикл
	
		Движение = Движения.ЗначенияНастроекУчетаЦенныхБумаг.Добавить();
		
		Движение.Период							= ЭтотОбъект.Дата;
		
		Движение.Организация					= ЭтотОбъект.Организация;
		Движение.Клиент							= КлиентДляДвижений;
		Движение.УчетныйАктивЕПС				= СтрокаНастройки.УчетныйАктивЕПС;
		Движение.Рынок							= Перечисления.РынкиЦенныхБумаг.Облигации;
		Движение.ЦеннаяБумага					= ЭтотОбъект.ЦеннаяБумага;
		Движение.Партия							= СтрокаНастройки.Партия;
		Движение.СтрокаПартии					= СтрокаНастройки.СтрокаПартии;
		Движение.Настройка						= СтрокаНастройки.Настройка;
		
		Движение.ЗначениеНастройки				= СтрокаНастройки.ЗначениеНастройки;
		Движение.Отключить						= СтрокаНастройки.Отключить;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// Заполняем тип сведений
	
	МассивСведений = Новый Массив;
	
	Если ЭтотОбъект.Аналоги.Количество() > 0 Тогда
		МассивСведений.Добавить("Аналоги");
	КонецЕсли;
	Если ЭтотОбъект.ЭСП.Количество() > 0 Тогда
		МассивСведений.Добавить("ЭСП");
	КонецЕсли;
	Если ЭтотОбъект.НастройкиУчета.Количество() > 0 Тогда
        //настройки развернем, покажем какие именно настройки есть в документе 
		КоличествоНастроек = 0;
		Для Каждого СтрокаТЧНастройкиУчета из ЭтотОбъект.НастройкиУчета Цикл
			НаименованиеНастройки = Строка(СтрокаТЧНастройкиУчета.Настройка); 
			Если МассивСведений.Найти(НаименованиеНастройки) = Неопределено Тогда
				МассивСведений.Добавить(НаименованиеНастройки); 
				КоличествоНастроек = КоличествоНастроек + 1;
			КонецЕсли;  
		КонецЦикла;   
	КонецЕсли;
	
	СтрокаТипСведений = СтрСоединить(МассивСведений, ", ");  
	Если СтрДлина(СтрокаТипСведений) > 100 Тогда
		//завершаем строку всегда настройками. Поэтому, если строка слишком длинная, показываем в конце количество настроек 
		ЗавершениеСтроки = "...(" + Формат(КоличествоНастроек, "ЧГ=0") + ")";
		СтрокаТипСведений = Лев(СтрокаТипСведений, 100 - СтрДлина(ЗавершениеСтроки)) + ЗавершениеСтроки;
	КонецЕсли;
	
	ЭтотОбъект.ТипСведений = СтрокаТипСведений; 
	
	// Блокирующие проверки
	
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Общие процедуры перед записью

	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
